tutorials/compressibleDXIsoFlow/FoucsedWaveOnSolidWall/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    outlet 
    {
        type            calculated;
        value           $internalField;
    }
    inlet 
    {
        type            calculated;
        value           $internalField;
    }
    bottom
    {
        type            calculated;
        value           $internalField;
    }
    slope
    {
        type            calculated;
        value           $internalField;
    }
    atmosphere 
    {
        type            calculated;
        value           $internalField;
    }
}


// ************************************************************************* //
