tutorials/compressibleDXIsoFlow/FoucsedWaveOnSolidWall/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform 1e-06;

boundaryField
{
    inlet
    {
        type            kqRWallFunction;
        value           uniform 1e-06;
    }
    outlet
    {
        type            kqRWallFunction;
        value           uniform 1e-06;
    }
    slope
    {
        type            kqRWallFunction;
        value           uniform 1e-06;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 1e-06;
        value           uniform 1e-06;
    }
    bottom
    {
        type            kqRWallFunction;
        value           uniform 1e-06;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
