tutorials/compressibleDXIsoFlow/FoucsedWaveOnSolidWall/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            PistonWaveGeneration;     
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
    outlet
    {
        type            fixedValue; 
        value           uniform (0 0 0);
    }
    bottom
    {
        type            zeroGradient;
    }
    slope
    {
        type            fixedValue; 
        value           uniform (0 0 0);
    }
    atmosphere
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
