tutorials/compressibleDXIsoFlow/FoucsedWaveOnSolidWall/system/topoSetDict1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {   // Free surface
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            //box (0 -1 -0.152) (44.4 1 0.184);
            box (0 -1 -0.12) (44.7 1 0.16);
        }
    }
    {   // back wall 
        name    c1;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            //box (44.4 -1 -1) (45 1 0.44);
            box (44.7 -1 -1) (45 1 0.44);
        }
    }
);

// ************************************************************************* //
